kernel/2014-09-27-linux-kernel-list.org
#+TITLE: Linux Kernel List
#+AUTHOR: Micky Ching
#+OPTIONS: H:4 ^:nil toc:nil
#+LATEX_CLASS: latex-doc

* 双向链表
相关文件为：
- include/linux/list.h

#+BEGIN_SRC cpp
  struct list_head {
      struct list_head *next, *prev;
  };
#+END_SRC
双向链表的结构只有两个指针，那么如何保存数据呢，
和其他嵌入式数据结构一样，双向链表嵌入到其他数据结构中，
可以根据二者在内存中的位置关系利用链表地址反向计算数据地址。
计算的函数如下。
#+BEGIN_SRC cpp
  #define list_entry(ptr, type, member) \
      container_of(ptr, type, member)
  #define container_of(ptr, type, member) \
      (type *)((char *)(ptr) - (char *) &((type *)0)->member)
#+END_SRC
根据提供的链表指针ptr，包含的数据类型type，以及链表在type的成员名字member，
就可以反向计算出type的地址。
** 生命周期
#+BEGIN_SRC cpp
  // 将链表初始化，也就是prev和next都指向自身
  #define LIST_HEAD_INIT(name) { &(name), &(name) }
  #define LIST_HEAD(name) \               // 静态定义一个双向链表
            struct list_head name = LIST_HEAD_INIT(name)
  // 和LIST_HEAD_INIT功能一样，这里传递的是指针，而前面传递的是对象
  void INIT_LIST_HEAD(struct list_head *list);
#+END_SRC
** 基本操作
#+BEGIN_SRC cpp
  // entry被添加到head后面
  void list_add(struct list_head *entry, struct list_head *head);
  // entry被添加到尾部，也就是head的前面
  void list_add_tail(struct list_head *entry, struct list_head *head);
  // 从链表删除entry
  void list_del(struct list_head *entry);
  // 从链表删除entry，并对entry本身初始化
  void list_del_init(struct list_head *entry);
  // 用new去替换掉old
  void list_replace(struct list_head *old, struct list_head *new);
  // 替换掉old之后对old初始化
  void list_replace_init(struct list_head *old, struct list_head *new);
  // 首先删除list，再将其添加到head后面
  void list_move(struct list_head *list, struct list_head *head);
  // 从链表中先将list删除，然后将其插入到链表尾部
  void list_move_tail(struct list_head *list, struct list_head *head);
  // 判断是否为空链表，空链表的next一定指向head
  bool list_empty(struct list_head *head);
  // 不仅判断next，还会判断prev是否也指向head
  int list_empty_careful(const struct list_head *head);
  // 判断list是否为最后一个节点
  int list_is_last(const struct list_head *list,
                   const struct list_head *head);
  // 判断链表是否只有一个节点，是的话第一个节点也是最后一个节点
  int list_is_singular(const struct list_head *head);
  // 向左移就是将第一个节点移动到尾巴去
  void list_rotate_left(struct list_head *head);
#+END_SRC
