kernel/2014-09-27-linux-kernel-list.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Linux Kernel List</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Micky Ching" />
<link rel="stylesheet" href="../theme/default.css" />


</head>
<body>
<div id="content">
<h1 class="title">Linux Kernel List</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 双向链表</a>
<ul>
<li><a href="#sec-1-1">1.1. 生命周期</a></li>
<li><a href="#sec-1-2">1.2. 基本操作</a></li>
<li><a href="#sec-1-3">1.3. 链表遍历</a></li>
<li><a href="#sec-1-4">1.4. 高级操作</a></li>
</ul>
</li>
<li><a href="#sec-2">2. 哈希链表</a>
<ul>
<li><a href="#sec-2-1">2.1. 生命周期</a></li>
<li><a href="#sec-2-2">2.2. 基本操作</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 双向链表</h2>
<div class="outline-text-2" id="text-1">
<p>
相关文件为：
</p>
<ul class="org-ul">
<li>include/linux/list.h
</li>
</ul>

<div class="org-src-container">

<pre class="src src-cpp"><span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">list_head</span> {
    <span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">list_head</span> *<span style="color: #000000;">next</span>, *<span style="color: #000000;">prev</span>;
};
</pre>
</div>
<p>
双向链表的结构只有两个指针，那么如何保存数据呢，
和其他嵌入式数据结构一样，双向链表嵌入到其他数据结构中，
可以根据二者在内存中的位置关系利用链表地址反向计算数据地址。
计算的函数如下。
</p>
<div class="org-src-container">

<pre class="src src-cpp"><span style="color: #000000;">#define</span> <span style="color: #8b008b; font-weight: bold;">list_entry</span>(<span style="color: #000000;">ptr</span>, <span style="color: #000000;">type</span>, <span style="color: #000000;">member</span>) \
    container_of(ptr, type, member)
<span style="color: #000000;">#define</span> <span style="color: #8b008b; font-weight: bold;">container_of</span>(<span style="color: #000000;">ptr</span>, <span style="color: #000000;">type</span>, <span style="color: #000000;">member</span>) \
    (<span style="color: #0000ff;">type</span> *)((<span style="color: #0000ff;">char</span> *)(ptr) - (<span style="color: #0000ff;">char</span> *) &amp;((<span style="color: #0000ff;">type</span> *)0)-&gt;member)
</pre>
</div>
<p>
根据提供的链表指针ptr，包含的数据类型type，以及链表在type的成员名字member，
就可以反向计算出type的地址。
</p>
</div>
<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> 生命周期</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">

<pre class="src src-cpp"><span style="color: #228b22; font-style: italic;">// </span><span style="color: #228b22; font-style: italic;">&#23558;&#38142;&#34920;&#21021;&#22987;&#21270;&#65292;&#20063;&#23601;&#26159;prev&#21644;next&#37117;&#25351;&#21521;&#33258;&#36523;</span>
<span style="color: #000000;">#define</span> <span style="color: #8b008b; font-weight: bold;">LIST_HEAD_INIT</span>(<span style="color: #000000;">name</span>) { &amp;(name), &amp;(name) }
<span style="color: #000000;">#define</span> <span style="color: #8b008b; font-weight: bold;">LIST_HEAD</span>(<span style="color: #000000;">name</span>) \               <span style="color: #228b22; font-style: italic;">// </span><span style="color: #228b22; font-style: italic;">&#38745;&#24577;&#23450;&#20041;&#19968;&#20010;&#21452;&#21521;&#38142;&#34920;</span>
          <span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">list_head</span> <span style="color: #000000;">name</span> = LIST_HEAD_INIT(name)
<span style="color: #228b22; font-style: italic;">// </span><span style="color: #228b22; font-style: italic;">&#21644;LIST_HEAD_INIT&#21151;&#33021;&#19968;&#26679;&#65292;&#36825;&#37324;&#20256;&#36882;&#30340;&#26159;&#25351;&#38024;&#65292;&#32780;&#21069;&#38754;&#20256;&#36882;&#30340;&#26159;&#23545;&#35937;</span>
<span style="color: #0000ff;">void</span> <span style="color: #8b008b; font-weight: bold;">INIT_LIST_HEAD</span>(<span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">list_head</span> *<span style="color: #000000;">list</span>);
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> 基本操作</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">

<pre class="src src-cpp"><span style="color: #228b22; font-style: italic;">// </span><span style="color: #228b22; font-style: italic;">entry&#34987;&#28155;&#21152;&#21040;head&#21518;&#38754;</span>
<span style="color: #0000ff;">void</span> <span style="color: #8b008b; font-weight: bold;">list_add</span>(<span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">list_head</span> *<span style="color: #000000;">entry</span>, <span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">list_head</span> *<span style="color: #000000;">head</span>);
<span style="color: #228b22; font-style: italic;">// </span><span style="color: #228b22; font-style: italic;">entry&#34987;&#28155;&#21152;&#21040;&#23614;&#37096;&#65292;&#20063;&#23601;&#26159;head&#30340;&#21069;&#38754;</span>
<span style="color: #0000ff;">void</span> <span style="color: #8b008b; font-weight: bold;">list_add_tail</span>(<span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">list_head</span> *<span style="color: #000000;">entry</span>, <span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">list_head</span> *<span style="color: #000000;">head</span>);
<span style="color: #228b22; font-style: italic;">// </span><span style="color: #228b22; font-style: italic;">&#20174;&#38142;&#34920;&#21024;&#38500;entry</span>
<span style="color: #0000ff;">void</span> <span style="color: #8b008b; font-weight: bold;">list_del</span>(<span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">list_head</span> *<span style="color: #000000;">entry</span>);
<span style="color: #228b22; font-style: italic;">// </span><span style="color: #228b22; font-style: italic;">&#20174;&#38142;&#34920;&#21024;&#38500;entry&#65292;&#24182;&#23545;entry&#26412;&#36523;&#21021;&#22987;&#21270;</span>
<span style="color: #0000ff;">void</span> <span style="color: #8b008b; font-weight: bold;">list_del_init</span>(<span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">list_head</span> *<span style="color: #000000;">entry</span>);
<span style="color: #228b22; font-style: italic;">// </span><span style="color: #228b22; font-style: italic;">&#29992;new&#21435;&#26367;&#25442;&#25481;old</span>
<span style="color: #0000ff;">void</span> <span style="color: #8b008b; font-weight: bold;">list_replace</span>(<span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">list_head</span> *<span style="color: #000000;">old</span>, <span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">list_head</span> *<span style="color: #0000ff; font-weight: bold;">new</span>);
<span style="color: #228b22; font-style: italic;">// </span><span style="color: #228b22; font-style: italic;">&#26367;&#25442;&#25481;old&#20043;&#21518;&#23545;old&#21021;&#22987;&#21270;</span>
<span style="color: #0000ff;">void</span> <span style="color: #8b008b; font-weight: bold;">list_replace_init</span>(<span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">list_head</span> *<span style="color: #000000;">old</span>, <span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">list_head</span> *<span style="color: #0000ff; font-weight: bold;">new</span>);
<span style="color: #228b22; font-style: italic;">// </span><span style="color: #228b22; font-style: italic;">&#39318;&#20808;&#21024;&#38500;list&#65292;&#20877;&#23558;&#20854;&#28155;&#21152;&#21040;head&#21518;&#38754;</span>
<span style="color: #0000ff;">void</span> <span style="color: #8b008b; font-weight: bold;">list_move</span>(<span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">list_head</span> *<span style="color: #000000;">list</span>, <span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">list_head</span> *<span style="color: #000000;">head</span>);
<span style="color: #228b22; font-style: italic;">// </span><span style="color: #228b22; font-style: italic;">&#20174;&#38142;&#34920;&#20013;&#20808;&#23558;list&#21024;&#38500;&#65292;&#28982;&#21518;&#23558;&#20854;&#25554;&#20837;&#21040;&#38142;&#34920;&#23614;&#37096;</span>
<span style="color: #0000ff;">void</span> <span style="color: #8b008b; font-weight: bold;">list_move_tail</span>(<span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">list_head</span> *<span style="color: #000000;">list</span>, <span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">list_head</span> *<span style="color: #000000;">head</span>);
<span style="color: #228b22; font-style: italic;">// </span><span style="color: #228b22; font-style: italic;">&#21028;&#26029;&#26159;&#21542;&#20026;&#31354;&#38142;&#34920;&#65292;&#31354;&#38142;&#34920;&#30340;next&#19968;&#23450;&#25351;&#21521;head</span>
<span style="color: #0000ff;">bool</span> <span style="color: #8b008b; font-weight: bold;">list_empty</span>(<span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">list_head</span> *<span style="color: #000000;">head</span>);
<span style="color: #228b22; font-style: italic;">// </span><span style="color: #228b22; font-style: italic;">&#19981;&#20165;&#21028;&#26029;next&#65292;&#36824;&#20250;&#21028;&#26029;prev&#26159;&#21542;&#20063;&#25351;&#21521;head</span>
<span style="color: #0000ff;">int</span> <span style="color: #8b008b; font-weight: bold;">list_empty_careful</span>(<span style="color: #0000ff; font-weight: bold;">const</span> <span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">list_head</span> *<span style="color: #000000;">head</span>);
<span style="color: #228b22; font-style: italic;">// </span><span style="color: #228b22; font-style: italic;">&#21028;&#26029;list&#26159;&#21542;&#20026;&#26368;&#21518;&#19968;&#20010;&#33410;&#28857;</span>
<span style="color: #0000ff;">int</span> <span style="color: #8b008b; font-weight: bold;">list_is_last</span>(<span style="color: #0000ff; font-weight: bold;">const</span> <span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">list_head</span> *<span style="color: #000000;">list</span>,
                 <span style="color: #0000ff; font-weight: bold;">const</span> <span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">list_head</span> *<span style="color: #000000;">head</span>);
<span style="color: #228b22; font-style: italic;">// </span><span style="color: #228b22; font-style: italic;">&#21028;&#26029;&#38142;&#34920;&#26159;&#21542;&#21482;&#26377;&#19968;&#20010;&#33410;&#28857;&#65292;&#26159;&#30340;&#35805;&#31532;&#19968;&#20010;&#33410;&#28857;&#20063;&#26159;&#26368;&#21518;&#19968;&#20010;&#33410;&#28857;</span>
<span style="color: #0000ff;">int</span> <span style="color: #8b008b; font-weight: bold;">list_is_singular</span>(<span style="color: #0000ff; font-weight: bold;">const</span> <span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">list_head</span> *<span style="color: #000000;">head</span>);
<span style="color: #228b22; font-style: italic;">// </span><span style="color: #228b22; font-style: italic;">&#21521;&#24038;&#31227;&#23601;&#26159;&#23558;&#31532;&#19968;&#20010;&#33410;&#28857;&#31227;&#21160;&#21040;&#23614;&#24052;&#21435;</span>
<span style="color: #0000ff;">void</span> <span style="color: #8b008b; font-weight: bold;">list_rotate_left</span>(<span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">list_head</span> *<span style="color: #000000;">head</span>);
</pre>
</div>
</div>
</div>
