kernel/2014-09-27-linux-kernel-list.org
** 链表遍历
在使用双向链表的时候要遵循一个规则，那就是链表头不能嵌入到数据中，
也就是说链表头和普通的链表节点是不一样的。
所以不能对链表头调用list_entry()，而必须使用下面的宏。
#+BEGIN_SRC cpp
  #define list_first_entry(ptr, type, member) \
      list_entry((ptr)->next, type, member)
  #define list_last_entry(ptr, type, member) \
      list_entry((ptr)->prev, type, member)
#+END_SRC

另外比较常用的操作是迭代链表，主要可以用如下一些宏。
#+BEGIN_SRC cpp
  #define __container_of(ptr, sample, member)                     \
      (void *)container_of((ptr), typeof(*(sample)), member)
#+END_SRC
这个宏的特殊之处在于我们不是去指定链表保存的数据类型，而是直接传递数据指针，
由typeof去帮我们提取数据类型。

#+BEGIN_SRC cpp
  #define list_for_each_entry(pos, head, member)                  \
      for (pos = __container_of((head)->next, pos, member);       \
           &pos->member != (head);                                \
           pos = __container_of(pos->member.next, pos, member))
  #define list_for_each_entry_safe(pos, tmp, head, member);
#+END_SRC
pos是我们想要得到的数据指针，head是链表头，所以必须从next开始获取，
结束条件是我们拿到了head的数据，显然这个数据是无效的。
一旦我们有了pos，往后面迭代的时候就不需要使用head，而直接可以使用pos->member了。
当然，如果我们在迭代过程中将当前节点删除，还不会有什么问题，
但是一旦我们删除后有对当前节点初始化，那么迭代就会终止。
更可怕的是如果我们将当前节点移动到了别的地方，那么就会产生致命错误，极可能系统崩溃。

安全版本运行删除当前元素，因为已经用tmp记录了下一个元素的位置。
此外还可以进行反向迭代。
#+BEGIN_SRC cpp
  #define list_for_each_entry_reverse(pos, head, member);
  #define list_for_each_entry_safe_reverse(pos, tmp, head, member);
#+END_SRC

** 高级操作
#+BEGIN_SRC cpp
  // 从head到entry为第一部分，包括entry本身将传递给list，
  // entry后面的部分作为第二部分，这部分给head
  void list_cut_position(struct list_head *list, struct list_head *head,
                         struct list_head *entry);
  // 将list链表插入到head头部，注意list是链表头，就是说list本身不会被插进去
  void list_splice(const struct list_head *list,
                   struct list_head *head);
  void list_splice_tail(struct list_head *list,
                        struct list_head *head);
  // 插入list到head之后对list进行初始化
  void list_splice_init(struct list_head *list,
                        struct list_head *head);
  void list_splice_tail_init(struct list_head *list,
                             struct list_head *head);

#+END_SRC
* 哈希链表
相关文件为：
- include/linux/list.h

哈希链表其实是单向链表，当next为NULL的时候就是链表尾部。
#+BEGIN_SRC cpp
  struct hlist_head {
      struct hlist_node *first;
  };
  struct hlist_node {
      struct hlist_node *next, **pprev;
  };
#+END_SRC
哈希表的本质是hlist_head的一个数组，既然是数组，长度就是固定的，
每当要向表中一个位置添加节点时，就将hlist_node加入到hlist_head所指定的链表中。
这里和双向链表的设计思路完全一样，链表头不用来存放数据，仅仅作为重要的参照标志。
为了节省空间，链表头只包含一个指针。

这里出现了一个pprev指针，它指向上一个hlist_node的next指针的地址，
如果前一个节点是hlist_head，那么就是hlist_head的first的地址。

** 生命周期
#+BEGIN_SRC cpp
  #define HLIST_HEAD(name) struct hlist_head name = { .first = NULL }
  #define HLIST_HEAD_INIT { .first = NULL }
  #define INIT_HLIST_HEAD(ptr) ((ptr)->first = NULL)
  static inline void INIT_HLIST_NODE(struct hlist_node *h)
  {
      h->next = NULL;
      h->pprev = NULL;
  }
#+END_SRC

