kernel/2014-09-27-linux-kernel-list.html
<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> 链表遍历</h3>
<div class="outline-text-3" id="text-1-3">
<p>
在使用双向链表的时候要遵循一个规则，那就是链表头不能嵌入到数据中，
也就是说链表头和普通的链表节点是不一样的。
所以不能对链表头调用list_entry()，而必须使用下面的宏。
</p>
<div class="org-src-container">

<pre class="src src-cpp"><span style="color: #000000;">#define</span> <span style="color: #8b008b; font-weight: bold;">list_first_entry</span>(<span style="color: #000000;">ptr</span>, <span style="color: #000000;">type</span>, <span style="color: #000000;">member</span>) \
    list_entry((ptr)-&gt;next, type, member)
<span style="color: #000000;">#define</span> <span style="color: #8b008b; font-weight: bold;">list_last_entry</span>(<span style="color: #000000;">ptr</span>, <span style="color: #000000;">type</span>, <span style="color: #000000;">member</span>) \
    list_entry((ptr)-&gt;prev, type, member)
</pre>
</div>

<p>
另外比较常用的操作是迭代链表，主要可以用如下一些宏。
</p>
<div class="org-src-container">

<pre class="src src-cpp"><span style="color: #000000;">#define</span> <span style="color: #8b008b; font-weight: bold;">__container_of</span>(<span style="color: #000000;">ptr</span>, <span style="color: #000000;">sample</span>, <span style="color: #000000;">member</span>)                     \
    (<span style="color: #0000ff;">void</span> *)container_of((ptr), typeof(*(sample)), member)
</pre>
</div>
<p>
这个宏的特殊之处在于我们不是去指定链表保存的数据类型，而是直接传递数据指针，
由typeof去帮我们提取数据类型。
</p>

<div class="org-src-container">

<pre class="src src-cpp"><span style="color: #000000;">#define</span> <span style="color: #8b008b; font-weight: bold;">list_for_each_entry</span>(<span style="color: #000000;">pos</span>, <span style="color: #000000;">head</span>, <span style="color: #000000;">member</span>)                  \
    <span style="color: #0000ff; font-weight: bold;">for</span> (pos = __container_of((head)-&gt;next, pos, member);       \
         &amp;pos-&gt;member != (head);                                \
         pos = __container_of(pos-&gt;member.next, pos, member))
<span style="color: #000000;">#define</span> <span style="color: #8b008b; font-weight: bold;">list_for_each_entry_safe</span>(<span style="color: #000000;">pos</span>, <span style="color: #000000;">tmp</span>, <span style="color: #000000;">head</span>, <span style="color: #000000;">member</span>);
</pre>
</div>
<p>
pos是我们想要得到的数据指针，head是链表头，所以必须从next开始获取，
结束条件是我们拿到了head的数据，显然这个数据是无效的。
一旦我们有了pos，往后面迭代的时候就不需要使用head，而直接可以使用pos-&gt;member了。
当然，如果我们在迭代过程中将当前节点删除，还不会有什么问题，
但是一旦我们删除后有对当前节点初始化，那么迭代就会终止。
更可怕的是如果我们将当前节点移动到了别的地方，那么就会产生致命错误，极可能系统崩溃。
</p>

<p>
安全版本运行删除当前元素，因为已经用tmp记录了下一个元素的位置。
此外还可以进行反向迭代。
</p>
<div class="org-src-container">

<pre class="src src-cpp"><span style="color: #000000;">#define</span> <span style="color: #8b008b; font-weight: bold;">list_for_each_entry_reverse</span>(<span style="color: #000000;">pos</span>, <span style="color: #000000;">head</span>, <span style="color: #000000;">member</span>);
<span style="color: #000000;">#define</span> <span style="color: #8b008b; font-weight: bold;">list_for_each_entry_safe_reverse</span>(<span style="color: #000000;">pos</span>, <span style="color: #000000;">tmp</span>, <span style="color: #000000;">head</span>, <span style="color: #000000;">member</span>);
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> 高级操作</h3>
<div class="outline-text-3" id="text-1-4">
<div class="org-src-container">

<pre class="src src-cpp"><span style="color: #228b22; font-style: italic;">// </span><span style="color: #228b22; font-style: italic;">&#20174;head&#21040;entry&#20026;&#31532;&#19968;&#37096;&#20998;&#65292;&#21253;&#25324;entry&#26412;&#36523;&#23558;&#20256;&#36882;&#32473;list&#65292;</span>
<span style="color: #228b22; font-style: italic;">// </span><span style="color: #228b22; font-style: italic;">entry&#21518;&#38754;&#30340;&#37096;&#20998;&#20316;&#20026;&#31532;&#20108;&#37096;&#20998;&#65292;&#36825;&#37096;&#20998;&#32473;head</span>
<span style="color: #0000ff;">void</span> <span style="color: #8b008b; font-weight: bold;">list_cut_position</span>(<span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">list_head</span> *<span style="color: #000000;">list</span>, <span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">list_head</span> *<span style="color: #000000;">head</span>,
                       <span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">list_head</span> *<span style="color: #000000;">entry</span>);
<span style="color: #228b22; font-style: italic;">// </span><span style="color: #228b22; font-style: italic;">&#23558;list&#38142;&#34920;&#25554;&#20837;&#21040;head&#22836;&#37096;&#65292;&#27880;&#24847;list&#26159;&#38142;&#34920;&#22836;&#65292;&#23601;&#26159;&#35828;list&#26412;&#36523;&#19981;&#20250;&#34987;&#25554;&#36827;&#21435;</span>
<span style="color: #0000ff;">void</span> <span style="color: #8b008b; font-weight: bold;">list_splice</span>(<span style="color: #0000ff; font-weight: bold;">const</span> <span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">list_head</span> *<span style="color: #000000;">list</span>,
                 <span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">list_head</span> *<span style="color: #000000;">head</span>);
<span style="color: #0000ff;">void</span> <span style="color: #8b008b; font-weight: bold;">list_splice_tail</span>(<span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">list_head</span> *<span style="color: #000000;">list</span>,
                      <span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">list_head</span> *<span style="color: #000000;">head</span>);
<span style="color: #228b22; font-style: italic;">// </span><span style="color: #228b22; font-style: italic;">&#25554;&#20837;list&#21040;head&#20043;&#21518;&#23545;list&#36827;&#34892;&#21021;&#22987;&#21270;</span>
<span style="color: #0000ff;">void</span> <span style="color: #8b008b; font-weight: bold;">list_splice_init</span>(<span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">list_head</span> *<span style="color: #000000;">list</span>,
                      <span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">list_head</span> *<span style="color: #000000;">head</span>);
<span style="color: #0000ff;">void</span> <span style="color: #8b008b; font-weight: bold;">list_splice_tail_init</span>(<span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">list_head</span> *<span style="color: #000000;">list</span>,
                           <span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">list_head</span> *<span style="color: #000000;">head</span>);
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 哈希链表</h2>
<div class="outline-text-2" id="text-2">
<p>
相关文件为：
</p>
<ul class="org-ul">
<li>include/linux/list.h
</li>
</ul>

<p>
哈希链表其实是单向链表，当next为NULL的时候就是链表尾部。
</p>
<div class="org-src-container">

<pre class="src src-cpp"><span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">hlist_head</span> {
    <span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">hlist_node</span> *<span style="color: #000000;">first</span>;
};
<span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">hlist_node</span> {
    <span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">hlist_node</span> *<span style="color: #000000;">next</span>, **<span style="color: #000000;">pprev</span>;
};
</pre>
</div>
<p>
哈希表的本质是hlist_head的一个数组，既然是数组，长度就是固定的，
每当要向表中一个位置添加节点时，就将hlist_node加入到hlist_head所指定的链表中。
这里和双向链表的设计思路完全一样，链表头不用来存放数据，仅仅作为重要的参照标志。
为了节省空间，链表头只包含一个指针。
</p>

<p>
这里出现了一个pprev指针，它指向上一个hlist_node的next指针的地址，
如果前一个节点是hlist_head，那么就是hlist_head的first的地址。
</p>
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> 生命周期</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">

<pre class="src src-cpp"><span style="color: #000000;">#define</span> <span style="color: #8b008b; font-weight: bold;">HLIST_HEAD</span>(<span style="color: #000000;">name</span>) <span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">hlist_head</span> <span style="color: #000000;">name</span> = { .first = <span style="color: #5f9ea0;">NULL</span> }
<span style="color: #000000;">#define</span> <span style="color: #000000;">HLIST_HEAD_INIT</span> { .first = <span style="color: #5f9ea0;">NULL</span> }
<span style="color: #000000;">#define</span> <span style="color: #8b008b; font-weight: bold;">INIT_HLIST_HEAD</span>(<span style="color: #000000;">ptr</span>) ((ptr)-&gt;first = <span style="color: #5f9ea0;">NULL</span>)
<span style="color: #0000ff; font-weight: bold;">static</span> <span style="color: #0000ff; font-weight: bold;">inline</span> <span style="color: #0000ff;">void</span> <span style="color: #8b008b; font-weight: bold;">INIT_HLIST_NODE</span>(<span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">hlist_node</span> *<span style="color: #000000;">h</span>)
{
    h-&gt;next = <span style="color: #5f9ea0;">NULL</span>;
    h-&gt;pprev = <span style="color: #5f9ea0;">NULL</span>;
}
</pre>
</div>
</div>
</div>
