kernel/2014-09-27-linux-kernel-list.org
** 基本操作
#+BEGIN_SRC cpp
  #define hlist_entry(ptr, type, member); // 和list_entry()原理一样
  // 判断哈希表节点是否未hash，实际判断其pprev是否为空
  int hlist_unhashed(const struct hlist_node *h);
  // 判断hasb链表是否为空，实际判断first是否为空
  int hlist_empty(const struct hlist_head *h);
  void hlist_del(struct hlist_node *n);
  void hlist_del_init(struct hlist_node *n);
  // 就是将n插入到h的第一个节点位置
  void hlist_add_head(struct hlist_node *n, struct hlist_head *h);
  // 将n插入到next之前
  void hlist_add_before(struct hlist_node *n, struct hlist_node *next);
  // 将n插入到prev之后
  void hlist_add_behind(struct hlist_node *n, struct hlist_node *prev);
  // 将old移动到new，old->first指向NULL
  void hlist_move_list(struct hlist_head *old, struct hlist_head *new);
#+END_SRC

哈希链表的遍历和双向链表工作原理一样，不过实现上要复杂一点，并且没有反向迭代的版本。
#+BEGIN_SRC cpp
  #define hlist_for_each_entry(pos, head, member);
  #define hlist_for_each_entry_safe(pos, tmp, head, member);
#+END_SRC
