kernel/2014-09-27-linux-kernel-list.html

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> 基本操作</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">

<pre class="src src-cpp"><span style="color: #000000;">#define</span> <span style="color: #8b008b; font-weight: bold;">hlist_entry</span>(<span style="color: #000000;">ptr</span>, <span style="color: #000000;">type</span>, <span style="color: #000000;">member</span>); <span style="color: #228b22; font-style: italic;">// </span><span style="color: #228b22; font-style: italic;">&#21644;list_entry()&#21407;&#29702;&#19968;&#26679;</span>
<span style="color: #228b22; font-style: italic;">// </span><span style="color: #228b22; font-style: italic;">&#21028;&#26029;&#21704;&#24076;&#34920;&#33410;&#28857;&#26159;&#21542;&#26410;hash&#65292;&#23454;&#38469;&#21028;&#26029;&#20854;pprev&#26159;&#21542;&#20026;&#31354;</span>
<span style="color: #0000ff;">int</span> <span style="color: #8b008b; font-weight: bold;">hlist_unhashed</span>(<span style="color: #0000ff; font-weight: bold;">const</span> <span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">hlist_node</span> *<span style="color: #000000;">h</span>);
<span style="color: #228b22; font-style: italic;">// </span><span style="color: #228b22; font-style: italic;">&#21028;&#26029;hasb&#38142;&#34920;&#26159;&#21542;&#20026;&#31354;&#65292;&#23454;&#38469;&#21028;&#26029;first&#26159;&#21542;&#20026;&#31354;</span>
<span style="color: #0000ff;">int</span> <span style="color: #8b008b; font-weight: bold;">hlist_empty</span>(<span style="color: #0000ff; font-weight: bold;">const</span> <span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">hlist_head</span> *<span style="color: #000000;">h</span>);
<span style="color: #0000ff;">void</span> <span style="color: #8b008b; font-weight: bold;">hlist_del</span>(<span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">hlist_node</span> *<span style="color: #000000;">n</span>);
<span style="color: #0000ff;">void</span> <span style="color: #8b008b; font-weight: bold;">hlist_del_init</span>(<span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">hlist_node</span> *<span style="color: #000000;">n</span>);
<span style="color: #228b22; font-style: italic;">// </span><span style="color: #228b22; font-style: italic;">&#23601;&#26159;&#23558;n&#25554;&#20837;&#21040;h&#30340;&#31532;&#19968;&#20010;&#33410;&#28857;&#20301;&#32622;</span>
<span style="color: #0000ff;">void</span> <span style="color: #8b008b; font-weight: bold;">hlist_add_head</span>(<span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">hlist_node</span> *<span style="color: #000000;">n</span>, <span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">hlist_head</span> *<span style="color: #000000;">h</span>);
<span style="color: #228b22; font-style: italic;">// </span><span style="color: #228b22; font-style: italic;">&#23558;n&#25554;&#20837;&#21040;next&#20043;&#21069;</span>
<span style="color: #0000ff;">void</span> <span style="color: #8b008b; font-weight: bold;">hlist_add_before</span>(<span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">hlist_node</span> *<span style="color: #000000;">n</span>, <span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">hlist_node</span> *<span style="color: #000000;">next</span>);
<span style="color: #228b22; font-style: italic;">// </span><span style="color: #228b22; font-style: italic;">&#23558;n&#25554;&#20837;&#21040;prev&#20043;&#21518;</span>
<span style="color: #0000ff;">void</span> <span style="color: #8b008b; font-weight: bold;">hlist_add_behind</span>(<span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">hlist_node</span> *<span style="color: #000000;">n</span>, <span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">hlist_node</span> *<span style="color: #000000;">prev</span>);
<span style="color: #228b22; font-style: italic;">// </span><span style="color: #228b22; font-style: italic;">&#23558;old&#31227;&#21160;&#21040;new&#65292;old-&gt;first&#25351;&#21521;NULL</span>
<span style="color: #0000ff;">void</span> <span style="color: #8b008b; font-weight: bold;">hlist_move_list</span>(<span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">hlist_head</span> *<span style="color: #000000;">old</span>, <span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">hlist_head</span> *<span style="color: #0000ff; font-weight: bold;">new</span>);
</pre>
</div>

<p>
哈希链表的遍历和双向链表工作原理一样，不过实现上要复杂一点，并且没有反向迭代的版本。
</p>
<div class="org-src-container">

<pre class="src src-cpp"><span style="color: #000000;">#define</span> <span style="color: #8b008b; font-weight: bold;">hlist_for_each_entry</span>(<span style="color: #000000;">pos</span>, <span style="color: #000000;">head</span>, <span style="color: #000000;">member</span>);
<span style="color: #000000;">#define</span> <span style="color: #8b008b; font-weight: bold;">hlist_for_each_entry_safe</span>(<span style="color: #000000;">pos</span>, <span style="color: #000000;">tmp</span>, <span style="color: #000000;">head</span>, <span style="color: #000000;">member</span>);
</pre>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
